In [38]:
import pandas as pd
from sklearn.preprocessing import OrdinalEncoder
from pprint import pprint

In [39]:
d = {
    "sales": [
        100000,
        222000,
        1000000,
        522000,
        111111,
        222222,
        1111111,
        20000,
        75000,
        90000,
        1000000,
        10000,
    ],
    "city": [
        "Tampa",
        "Tampa",
        "Orlando",
        "Jacksonville",
        "Miami",
        "Jacksonville",
        "Miami",
        "Miami",
        "Orlando",
        "Orlando",
        "Orlando",
        "Orlando",
    ],
    "size": [
        "Small",
        "Medium",
        "Large",
        "Large",
        "Small",
        "Medium",
        "Large",
        "Small",
        "Medium",
        "Medium",
        "Medium",
        "Small",
    ],
}

In [40]:
df = pd.DataFrame(data=d)
df

      sales          city    size
0    100000         Tampa   Small
1    222000         Tampa  Medium
2   1000000       Orlando   Large
3    522000  Jacksonville   Large
4    111111         Miami   Small
5    222222  Jacksonville  Medium
6   1111111         Miami   Large
7     20000         Miami   Small
8     75000       Orlando  Medium
9     90000       Orlando  Medium
10  1000000       Orlando  Medium
11    10000       Orlando   Small

In [41]:
df['size'].unique()

array(['Small', 'Medium', 'Large'], dtype=object)

In [42]:
sizes = ["Small", "Medium", "Large"]

In [43]:
enc = OrdinalEncoder(categories=[sizes])
print(enc.fit_transform(df[["size"]]))

[[0.]
 [1.]
 [2.]
 [2.]
 [0.]
 [1.]
 [2.]
 [0.]
 [1.]
 [1.]
 [1.]
 [0.]]

In [44]:
df["size"] = enc.fit_transform(df[["size"]])

In [45]:
df

      sales          city  size
0    100000         Tampa   0.0
1    222000         Tampa   1.0
2   1000000       Orlando   2.0
3    522000  Jacksonville   2.0
4    111111         Miami   0.0
5    222222  Jacksonville   1.0
6   1111111         Miami   2.0
7     20000         Miami   0.0
8     75000       Orlando   1.0
9     90000       Orlando   1.0
10  1000000       Orlando   1.0
11    10000       Orlando   0.0